/*31.（**）输入若干学生一门功课的成绩，统计各分数段的人数。凡不及格（60分以下）
都有一个计数器来统计，其它以10分作为一个分数段，100分作为一个分数段。总分100 
*/
#include <stdio.h>  
main(){
   int n;
   int a1=0,a2=0,a3=0,a4=0,a5=0,a6=0;
   printf("请输入成绩,输入-1结束:\n");
   scanf("%d",&n);
   while(n!=-1)
   {
        if(1<=n&&n<60)          a1+=1;
        else if(60<=n&&n<70)    a2+=1;
        else if(70<=n&&n<80)    a3+=1;
        else if(80<=n&&n<90)    a4+=1;
        else if(90<=n&&n<100)   a5=+1;
        else a6+=1; 
        scanf("%d",&n);
   }
   printf("1~59分数段的人回数答为:%d\n",a1);
   printf("60~69分数段的人数为:%d\n",a2);
   printf("70~79分数段的人数为:%d\n",a3);
   printf("80~89分数段的人数为:%d\n",a4);
   printf("90~99分数段的人数为:%d\n",a5);
   printf("100分的人数为:%d\n",a6);
}
